src/Catalogs/СтатусыЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>СтатусыЗаявки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Comment>Заголовок кнопки для следующего статуса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ожидающий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформление</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Альтернативный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Альтернативный1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Альтернативный2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Альтернативный3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Следующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Следующий1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Следующий2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Следующий3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Видимость</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доступность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Действия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КадровыеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/СтатусыЗаявки/Forms/ФормаНастройкаСвойствКнопки/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Реквизит Из ПолучитьРеквизиты() Цикл
		Имя = ?(Реквизит.Имя="ЗаголовокКнопки", "Заголовок", Реквизит.Имя);
		Если Параметры.Свойство(Имя) Тогда
			Параметры.Свойство(Имя, ЭтаФорма[Реквизит.Имя]);
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(Элементы.КнопкаОбразец, Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформление()
	
	ЗаполнитьЗначенияСвойств(Элементы.КнопкаОбразец, РеквизитыВСтруктуру());
	
КонецПроцедуры

&НаКлиенте
Процедура ОформлениеПриИзменении(Элемент)
	
	УстановитьОформление();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСистемноеЗначение(Имя)
	
	Возврат ?(Лев(Имя, 4)="Цвет", ЦветаСтиля[Имя+"Кнопки"], ШрифтыСтиля.ОбычныйШрифтТекста);	
	
КонецФункции

&НаКлиенте
Процедура ОформлениеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЭтаФорма[Элемент.Имя] = ПолучитьСистемноеЗначение(Элемент.Имя);
	
	УстановитьОформление();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокКартинок()
	
	Список = Новый СписокЗначений;
	Список.Добавить(Новый Картинка, "< ОЧИСТИТЬ КАРТИНКУ >");
	Для Каждого ОбщаяКартинка Из Метаданные.ОбщиеКартинки Цикл
		Имя = ОбщаяКартинка.Имя;
	    Список.Добавить(БиблиотекаКартинок[Имя], ОбщаяКартинка.Синоним,, БиблиотекаКартинок[Имя]);
	КонецЦикла;
	
	Возврат Список;
		
КонецФункции

&НаКлиенте
Процедура КартинкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОповещениеВыбора = Новый ОписаниеОповещения("КартинкаНажатиеЗавершение", ЭтотОбъект);
	ПоказатьВыборИзСписка(ОповещениеВыбора, ПолучитьСписокКартинок(), Элементы.Картинка);
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаНажатиеЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт

	Если ВыбранныйЭлемент <> Неопределено Тогда
		Картинка = ВыбранныйЭлемент.Значение;
		УстановитьОформление();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РеквизитыВСтруктуру()
	
	Реквизиты = Новый Структура;
	
	Для Каждого Реквизит Из ПолучитьРеквизиты() Цикл
		Реквизиты.Вставить(?(Реквизит.Имя="ЗаголовокКнопки", "Заголовок", Реквизит.Имя), ЭтаФорма[Реквизит.Имя]);
	КонецЦикла;
	
	Возврат Реквизиты;
	
КонецФункции

&НаКлиенте
Процедура КомандаПрименить(Команда)
	
	ОповеститьОВыборе(РеквизитыВСтруктуру());
	
КонецПроцедуры
